#테트로미노
def solution(n, m, paper):
    tetrominos = [[(0, 0), (0, 1), (0, 2), (0, 3)], [(0, 0), (1, 0), (2, 0), (3, 0)], [(0, 0), (0, 1), (1, 0), (1, 1)],
        [(0, 0), (1, 0), (2, 0), (2, 1)], [(2, 0), (0, 1), (1, 1), (2, 1)], [(0, 0), (0, 1), (1, 0), (2, 0)], [(0, 0), (0, 1), (1, 1), (2, 1)],
        [(0, 0), (1, 0), (0, 1), (0, 2)], [(0, 0), (0, 1), (0, 2), (1, 2)], [(0, 0), (1, 0), (1, 1), (1, 2)], [(1, 0), (1, 1), (1, 2), (0, 2)],
        [(0, 0), (1, 0), (1, 1), (2, 1)], [(0, 1), (1, 1), (1, 0), (2, 0)], [(1, 0), (1, 1), (0, 1), (0, 2)], [(0, 0), (0, 1), (1, 1), (1, 2)],
        [(0, 0), (0, 1), (0, 2), (1, 1)], [(0, 0), (1, 0), (1, 1), (2, 0)], [(1, 0), (1, 1), (1, 2), (0, 1)], [(1, 0), (0, 1), (1, 1), (2, 1)]
    ]
    biggest = -float('inf')
    for t in tetrominos:
        for i in range(n):
            for j in range(m):
                cnt = 0
                total = 0
                for ti, tj in t:
                    if 0 <= i + ti < n and 0 <= j + tj < m:
                        cnt += 1
                        total += paper[i+ti][j+tj]
                if cnt == 4:
                    biggest = max(biggest, total)
    return biggest

n, m = map(int, input().split())
paper = [list(map(int, input().split())) for _ in range(n)]
print(solution(n, m, paper))